# заполнение словаря
my_dict = {
    'tuple': (1, 2, 3, 4, 5),
    'list': [14, 28, 33, 40, 51],
    'dict': {
        'a': 1,
        'b': 9,
        'c': 3,
        'd': 11,
        'e': 10
    },
    'set': {101, 201, 300, 401, 503}
}

# вывод последнего элемента
print(my_dict['tuple'][-1])

# добавляем элемент в конец
my_dict['list'].append(63)

# удаляем второй элемент
my_dict['list'].pop(1)

# добавляем элемент
my_dict['dict'][('i am a tuple',)] = 'new value'

# удаляем элемент
my_dict['dict'].pop('a')

# добавляем элемент
my_dict['set'].add(696)

# удаляем элемент
my_dict['set'].remove(201)

# итог вывода
print("Весь словарь:")

# вывод самого словаря
print(my_dict)
